----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 32, 14, 14]             288
       BatchNorm2d-2           [-1, 32, 14, 14]              64
              SiLU-3           [-1, 32, 14, 14]               0
            Conv2d-4           [-1, 32, 14, 14]             288
       BatchNorm2d-5           [-1, 32, 14, 14]              64
              SiLU-6           [-1, 32, 14, 14]               0
 AdaptiveAvgPool2d-7             [-1, 32, 1, 1]               0
            Conv2d-8              [-1, 8, 1, 1]             264
              SiLU-9              [-1, 8, 1, 1]               0
           Conv2d-10             [-1, 32, 1, 1]             288
          Sigmoid-11             [-1, 32, 1, 1]               0
           Conv2d-12             [-1, 16, 1, 1]             512
      BatchNorm2d-13             [-1, 16, 1, 1]              32
      MBConvBlock-14             [-1, 16, 1, 1]               0
           Conv2d-15             [-1, 96, 1, 1]           1,536
      BatchNorm2d-16             [-1, 96, 1, 1]             192
             SiLU-17             [-1, 96, 1, 1]               0
           Conv2d-18             [-1, 96, 1, 1]             864
      BatchNorm2d-19             [-1, 96, 1, 1]             192
             SiLU-20             [-1, 96, 1, 1]               0
AdaptiveAvgPool2d-21             [-1, 96, 1, 1]               0
           Conv2d-22             [-1, 24, 1, 1]           2,328
             SiLU-23             [-1, 24, 1, 1]               0
           Conv2d-24             [-1, 96, 1, 1]           2,400
          Sigmoid-25             [-1, 96, 1, 1]               0
           Conv2d-26             [-1, 24, 1, 1]           2,304
      BatchNorm2d-27             [-1, 24, 1, 1]              48
      MBConvBlock-28             [-1, 24, 1, 1]               0
           Conv2d-29            [-1, 144, 1, 1]           3,456
      BatchNorm2d-30            [-1, 144, 1, 1]             288
             SiLU-31            [-1, 144, 1, 1]               0
           Conv2d-32            [-1, 144, 1, 1]           1,296
      BatchNorm2d-33            [-1, 144, 1, 1]             288
             SiLU-34            [-1, 144, 1, 1]               0
AdaptiveAvgPool2d-35            [-1, 144, 1, 1]               0
           Conv2d-36             [-1, 36, 1, 1]           5,220
             SiLU-37             [-1, 36, 1, 1]               0
           Conv2d-38            [-1, 144, 1, 1]           5,328
          Sigmoid-39            [-1, 144, 1, 1]               0
           Conv2d-40             [-1, 24, 1, 1]           3,456
      BatchNorm2d-41             [-1, 24, 1, 1]              48
      MBConvBlock-42             [-1, 24, 1, 1]               0
           Conv2d-43            [-1, 144, 1, 1]           3,456
      BatchNorm2d-44            [-1, 144, 1, 1]             288
             SiLU-45            [-1, 144, 1, 1]               0
           Conv2d-46            [-1, 144, 1, 1]           1,296
      BatchNorm2d-47            [-1, 144, 1, 1]             288
             SiLU-48            [-1, 144, 1, 1]               0
AdaptiveAvgPool2d-49            [-1, 144, 1, 1]               0
           Conv2d-50             [-1, 36, 1, 1]           5,220
             SiLU-51             [-1, 36, 1, 1]               0
           Conv2d-52            [-1, 144, 1, 1]           5,328
          Sigmoid-53            [-1, 144, 1, 1]               0
           Conv2d-54             [-1, 40, 1, 1]           5,760
      BatchNorm2d-55             [-1, 40, 1, 1]              80
      MBConvBlock-56             [-1, 40, 1, 1]               0
           Conv2d-57            [-1, 240, 1, 1]           9,600
      BatchNorm2d-58            [-1, 240, 1, 1]             480
             SiLU-59            [-1, 240, 1, 1]               0
           Conv2d-60            [-1, 240, 1, 1]           2,160
      BatchNorm2d-61            [-1, 240, 1, 1]             480
             SiLU-62            [-1, 240, 1, 1]               0
AdaptiveAvgPool2d-63            [-1, 240, 1, 1]               0
           Conv2d-64             [-1, 60, 1, 1]          14,460
             SiLU-65             [-1, 60, 1, 1]               0
           Conv2d-66            [-1, 240, 1, 1]          14,640
          Sigmoid-67            [-1, 240, 1, 1]               0
           Conv2d-68             [-1, 40, 1, 1]           9,600
      BatchNorm2d-69             [-1, 40, 1, 1]              80
      MBConvBlock-70             [-1, 40, 1, 1]               0
           Conv2d-71            [-1, 240, 1, 1]           9,600
      BatchNorm2d-72            [-1, 240, 1, 1]             480
             SiLU-73            [-1, 240, 1, 1]               0
           Conv2d-74            [-1, 240, 1, 1]           2,160
      BatchNorm2d-75            [-1, 240, 1, 1]             480
             SiLU-76            [-1, 240, 1, 1]               0
AdaptiveAvgPool2d-77            [-1, 240, 1, 1]               0
           Conv2d-78             [-1, 60, 1, 1]          14,460
             SiLU-79             [-1, 60, 1, 1]               0
           Conv2d-80            [-1, 240, 1, 1]          14,640
          Sigmoid-81            [-1, 240, 1, 1]               0
           Conv2d-82             [-1, 80, 1, 1]          19,200
      BatchNorm2d-83             [-1, 80, 1, 1]             160
      MBConvBlock-84             [-1, 80, 1, 1]               0
           Conv2d-85            [-1, 480, 1, 1]          38,400
      BatchNorm2d-86            [-1, 480, 1, 1]             960
             SiLU-87            [-1, 480, 1, 1]               0
           Conv2d-88            [-1, 480, 1, 1]           4,320
      BatchNorm2d-89            [-1, 480, 1, 1]             960
             SiLU-90            [-1, 480, 1, 1]               0
AdaptiveAvgPool2d-91            [-1, 480, 1, 1]               0
           Conv2d-92            [-1, 120, 1, 1]          57,720
             SiLU-93            [-1, 120, 1, 1]               0
           Conv2d-94            [-1, 480, 1, 1]          58,080
          Sigmoid-95            [-1, 480, 1, 1]               0
           Conv2d-96             [-1, 80, 1, 1]          38,400
      BatchNorm2d-97             [-1, 80, 1, 1]             160
      MBConvBlock-98             [-1, 80, 1, 1]               0
           Conv2d-99            [-1, 480, 1, 1]          38,400
     BatchNorm2d-100            [-1, 480, 1, 1]             960
            SiLU-101            [-1, 480, 1, 1]               0
          Conv2d-102            [-1, 480, 1, 1]           4,320
     BatchNorm2d-103            [-1, 480, 1, 1]             960
            SiLU-104            [-1, 480, 1, 1]               0
AdaptiveAvgPool2d-105            [-1, 480, 1, 1]               0
          Conv2d-106            [-1, 120, 1, 1]          57,720
            SiLU-107            [-1, 120, 1, 1]               0
          Conv2d-108            [-1, 480, 1, 1]          58,080
         Sigmoid-109            [-1, 480, 1, 1]               0
          Conv2d-110             [-1, 80, 1, 1]          38,400
     BatchNorm2d-111             [-1, 80, 1, 1]             160
     MBConvBlock-112             [-1, 80, 1, 1]               0
          Conv2d-113            [-1, 480, 1, 1]          38,400
     BatchNorm2d-114            [-1, 480, 1, 1]             960
            SiLU-115            [-1, 480, 1, 1]               0
          Conv2d-116            [-1, 480, 1, 1]           4,320
     BatchNorm2d-117            [-1, 480, 1, 1]             960
            SiLU-118            [-1, 480, 1, 1]               0
AdaptiveAvgPool2d-119            [-1, 480, 1, 1]               0
          Conv2d-120            [-1, 120, 1, 1]          57,720
            SiLU-121            [-1, 120, 1, 1]               0
          Conv2d-122            [-1, 480, 1, 1]          58,080
         Sigmoid-123            [-1, 480, 1, 1]               0
          Conv2d-124            [-1, 112, 1, 1]          53,760
     BatchNorm2d-125            [-1, 112, 1, 1]             224
     MBConvBlock-126            [-1, 112, 1, 1]               0
          Conv2d-127            [-1, 672, 1, 1]          75,264
     BatchNorm2d-128            [-1, 672, 1, 1]           1,344
            SiLU-129            [-1, 672, 1, 1]               0
          Conv2d-130            [-1, 672, 1, 1]           6,048
     BatchNorm2d-131            [-1, 672, 1, 1]           1,344
            SiLU-132            [-1, 672, 1, 1]               0
AdaptiveAvgPool2d-133            [-1, 672, 1, 1]               0
          Conv2d-134            [-1, 168, 1, 1]         113,064
            SiLU-135            [-1, 168, 1, 1]               0
          Conv2d-136            [-1, 672, 1, 1]         113,568
         Sigmoid-137            [-1, 672, 1, 1]               0
          Conv2d-138            [-1, 112, 1, 1]          75,264
     BatchNorm2d-139            [-1, 112, 1, 1]             224
     MBConvBlock-140            [-1, 112, 1, 1]               0
          Conv2d-141            [-1, 672, 1, 1]          75,264
     BatchNorm2d-142            [-1, 672, 1, 1]           1,344
            SiLU-143            [-1, 672, 1, 1]               0
          Conv2d-144            [-1, 672, 1, 1]           6,048
     BatchNorm2d-145            [-1, 672, 1, 1]           1,344
            SiLU-146            [-1, 672, 1, 1]               0
AdaptiveAvgPool2d-147            [-1, 672, 1, 1]               0
          Conv2d-148            [-1, 168, 1, 1]         113,064
            SiLU-149            [-1, 168, 1, 1]               0
          Conv2d-150            [-1, 672, 1, 1]         113,568
         Sigmoid-151            [-1, 672, 1, 1]               0
          Conv2d-152            [-1, 112, 1, 1]          75,264
     BatchNorm2d-153            [-1, 112, 1, 1]             224
     MBConvBlock-154            [-1, 112, 1, 1]               0
          Conv2d-155            [-1, 672, 1, 1]          75,264
     BatchNorm2d-156            [-1, 672, 1, 1]           1,344
            SiLU-157            [-1, 672, 1, 1]               0
          Conv2d-158            [-1, 672, 1, 1]           6,048
     BatchNorm2d-159            [-1, 672, 1, 1]           1,344
            SiLU-160            [-1, 672, 1, 1]               0
AdaptiveAvgPool2d-161            [-1, 672, 1, 1]               0
          Conv2d-162            [-1, 168, 1, 1]         113,064
            SiLU-163            [-1, 168, 1, 1]               0
          Conv2d-164            [-1, 672, 1, 1]         113,568
         Sigmoid-165            [-1, 672, 1, 1]               0
          Conv2d-166            [-1, 192, 1, 1]         129,024
     BatchNorm2d-167            [-1, 192, 1, 1]             384
     MBConvBlock-168            [-1, 192, 1, 1]               0
          Conv2d-169           [-1, 1152, 1, 1]         221,184
     BatchNorm2d-170           [-1, 1152, 1, 1]           2,304
            SiLU-171           [-1, 1152, 1, 1]               0
          Conv2d-172           [-1, 1152, 1, 1]          10,368
     BatchNorm2d-173           [-1, 1152, 1, 1]           2,304
            SiLU-174           [-1, 1152, 1, 1]               0
AdaptiveAvgPool2d-175           [-1, 1152, 1, 1]               0
          Conv2d-176            [-1, 288, 1, 1]         332,064
            SiLU-177            [-1, 288, 1, 1]               0
          Conv2d-178           [-1, 1152, 1, 1]         332,928
         Sigmoid-179           [-1, 1152, 1, 1]               0
          Conv2d-180            [-1, 192, 1, 1]         221,184
     BatchNorm2d-181            [-1, 192, 1, 1]             384
     MBConvBlock-182            [-1, 192, 1, 1]               0
          Conv2d-183           [-1, 1152, 1, 1]         221,184
     BatchNorm2d-184           [-1, 1152, 1, 1]           2,304
            SiLU-185           [-1, 1152, 1, 1]               0
          Conv2d-186           [-1, 1152, 1, 1]          10,368
     BatchNorm2d-187           [-1, 1152, 1, 1]           2,304
            SiLU-188           [-1, 1152, 1, 1]               0
AdaptiveAvgPool2d-189           [-1, 1152, 1, 1]               0
          Conv2d-190            [-1, 288, 1, 1]         332,064
            SiLU-191            [-1, 288, 1, 1]               0
          Conv2d-192           [-1, 1152, 1, 1]         332,928
         Sigmoid-193           [-1, 1152, 1, 1]               0
          Conv2d-194            [-1, 192, 1, 1]         221,184
     BatchNorm2d-195            [-1, 192, 1, 1]             384
     MBConvBlock-196            [-1, 192, 1, 1]               0
          Conv2d-197           [-1, 1152, 1, 1]         221,184
     BatchNorm2d-198           [-1, 1152, 1, 1]           2,304
            SiLU-199           [-1, 1152, 1, 1]               0
          Conv2d-200           [-1, 1152, 1, 1]          10,368
     BatchNorm2d-201           [-1, 1152, 1, 1]           2,304
            SiLU-202           [-1, 1152, 1, 1]               0
AdaptiveAvgPool2d-203           [-1, 1152, 1, 1]               0
          Conv2d-204            [-1, 288, 1, 1]         332,064
            SiLU-205            [-1, 288, 1, 1]               0
          Conv2d-206           [-1, 1152, 1, 1]         332,928
         Sigmoid-207           [-1, 1152, 1, 1]               0
          Conv2d-208            [-1, 192, 1, 1]         221,184
     BatchNorm2d-209            [-1, 192, 1, 1]             384
     MBConvBlock-210            [-1, 192, 1, 1]               0
          Conv2d-211           [-1, 1152, 1, 1]         221,184
     BatchNorm2d-212           [-1, 1152, 1, 1]           2,304
            SiLU-213           [-1, 1152, 1, 1]               0
          Conv2d-214           [-1, 1152, 1, 1]          10,368
     BatchNorm2d-215           [-1, 1152, 1, 1]           2,304
            SiLU-216           [-1, 1152, 1, 1]               0
AdaptiveAvgPool2d-217           [-1, 1152, 1, 1]               0
          Conv2d-218            [-1, 288, 1, 1]         332,064
            SiLU-219            [-1, 288, 1, 1]               0
          Conv2d-220           [-1, 1152, 1, 1]         332,928
         Sigmoid-221           [-1, 1152, 1, 1]               0
          Conv2d-222            [-1, 320, 1, 1]         368,640
     BatchNorm2d-223            [-1, 320, 1, 1]             640
     MBConvBlock-224            [-1, 320, 1, 1]               0
          Conv2d-225           [-1, 1280, 1, 1]         409,600
     BatchNorm2d-226           [-1, 1280, 1, 1]           2,560
            SiLU-227           [-1, 1280, 1, 1]               0
AdaptiveAvgPool2d-228           [-1, 1280, 1, 1]               0
         Dropout-229           [-1, 1280, 1, 1]               0
         Flatten-230                 [-1, 1280]               0
          Linear-231                   [-1, 10]          12,810
================================================================
Total params: 7,053,706
Trainable params: 7,053,706
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 1.04
Params size (MB): 26.91
Estimated Total Size (MB): 27.95
----------------------------------------------------------------
