----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 96, 224, 224]           2,688
       BatchNorm2d-2         [-1, 96, 224, 224]             192
         MaxPool2d-3         [-1, 96, 112, 112]               0
            Conv2d-4        [-1, 256, 112, 112]         221,440
       BatchNorm2d-5        [-1, 256, 112, 112]             512
         MaxPool2d-6          [-1, 256, 56, 56]               0
            Conv2d-7          [-1, 256, 56, 56]         590,080
       BatchNorm2d-8          [-1, 256, 56, 56]             512
         MaxPool2d-9          [-1, 256, 28, 28]               0
           Linear-10                 [-1, 4096]      16,781,312
          Dropout-11                 [-1, 4096]               0
           Linear-12                 [-1, 4096]      16,781,312
          Dropout-13                 [-1, 4096]               0
           Linear-14                   [-1, 10]          40,970
================================================================
Total params: 34,419,018
Trainable params: 34,419,018
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 151.72
Params size (MB): 131.30
Estimated Total Size (MB): 283.59
----------------------------------------------------------------
