----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 14, 14]           3,200
       BatchNorm2d-2           [-1, 64, 14, 14]             128
              ReLU-3           [-1, 64, 14, 14]               0
         MaxPool2d-4             [-1, 64, 7, 7]               0
            Conv2d-5             [-1, 64, 7, 7]          36,928
       BatchNorm2d-6             [-1, 64, 7, 7]             128
              ReLU-7             [-1, 64, 7, 7]               0
            Conv2d-8             [-1, 64, 7, 7]          36,928
       BatchNorm2d-9             [-1, 64, 7, 7]             128
             ReLU-10             [-1, 64, 7, 7]               0
       BasicBlock-11             [-1, 64, 7, 7]               0
           Conv2d-12             [-1, 64, 7, 7]          36,928
      BatchNorm2d-13             [-1, 64, 7, 7]             128
             ReLU-14             [-1, 64, 7, 7]               0
           Conv2d-15             [-1, 64, 7, 7]          36,928
      BatchNorm2d-16             [-1, 64, 7, 7]             128
             ReLU-17             [-1, 64, 7, 7]               0
       BasicBlock-18             [-1, 64, 7, 7]               0
           Conv2d-19             [-1, 64, 7, 7]          36,928
      BatchNorm2d-20             [-1, 64, 7, 7]             128
             ReLU-21             [-1, 64, 7, 7]               0
           Conv2d-22             [-1, 64, 7, 7]          36,928
      BatchNorm2d-23             [-1, 64, 7, 7]             128
             ReLU-24             [-1, 64, 7, 7]               0
       BasicBlock-25             [-1, 64, 7, 7]               0
           Conv2d-26            [-1, 128, 4, 4]          73,856
      BatchNorm2d-27            [-1, 128, 4, 4]             256
             ReLU-28            [-1, 128, 4, 4]               0
           Conv2d-29            [-1, 128, 4, 4]         147,584
      BatchNorm2d-30            [-1, 128, 4, 4]             256
           Conv2d-31            [-1, 128, 4, 4]           8,320
      BatchNorm2d-32            [-1, 128, 4, 4]             256
             ReLU-33            [-1, 128, 4, 4]               0
       BasicBlock-34            [-1, 128, 4, 4]               0
           Conv2d-35            [-1, 128, 4, 4]         147,584
      BatchNorm2d-36            [-1, 128, 4, 4]             256
             ReLU-37            [-1, 128, 4, 4]               0
           Conv2d-38            [-1, 128, 4, 4]         147,584
      BatchNorm2d-39            [-1, 128, 4, 4]             256
             ReLU-40            [-1, 128, 4, 4]               0
       BasicBlock-41            [-1, 128, 4, 4]               0
           Conv2d-42            [-1, 128, 4, 4]         147,584
      BatchNorm2d-43            [-1, 128, 4, 4]             256
             ReLU-44            [-1, 128, 4, 4]               0
           Conv2d-45            [-1, 128, 4, 4]         147,584
      BatchNorm2d-46            [-1, 128, 4, 4]             256
             ReLU-47            [-1, 128, 4, 4]               0
       BasicBlock-48            [-1, 128, 4, 4]               0
           Conv2d-49            [-1, 128, 4, 4]         147,584
      BatchNorm2d-50            [-1, 128, 4, 4]             256
             ReLU-51            [-1, 128, 4, 4]               0
           Conv2d-52            [-1, 128, 4, 4]         147,584
      BatchNorm2d-53            [-1, 128, 4, 4]             256
             ReLU-54            [-1, 128, 4, 4]               0
       BasicBlock-55            [-1, 128, 4, 4]               0
           Conv2d-56            [-1, 256, 2, 2]         295,168
      BatchNorm2d-57            [-1, 256, 2, 2]             512
             ReLU-58            [-1, 256, 2, 2]               0
           Conv2d-59            [-1, 256, 2, 2]         590,080
      BatchNorm2d-60            [-1, 256, 2, 2]             512
           Conv2d-61            [-1, 256, 2, 2]          33,024
      BatchNorm2d-62            [-1, 256, 2, 2]             512
             ReLU-63            [-1, 256, 2, 2]               0
       BasicBlock-64            [-1, 256, 2, 2]               0
           Conv2d-65            [-1, 256, 2, 2]         590,080
      BatchNorm2d-66            [-1, 256, 2, 2]             512
             ReLU-67            [-1, 256, 2, 2]               0
           Conv2d-68            [-1, 256, 2, 2]         590,080
      BatchNorm2d-69            [-1, 256, 2, 2]             512
             ReLU-70            [-1, 256, 2, 2]               0
       BasicBlock-71            [-1, 256, 2, 2]               0
           Conv2d-72            [-1, 256, 2, 2]         590,080
      BatchNorm2d-73            [-1, 256, 2, 2]             512
             ReLU-74            [-1, 256, 2, 2]               0
           Conv2d-75            [-1, 256, 2, 2]         590,080
      BatchNorm2d-76            [-1, 256, 2, 2]             512
             ReLU-77            [-1, 256, 2, 2]               0
       BasicBlock-78            [-1, 256, 2, 2]               0
           Conv2d-79            [-1, 256, 2, 2]         590,080
      BatchNorm2d-80            [-1, 256, 2, 2]             512
             ReLU-81            [-1, 256, 2, 2]               0
           Conv2d-82            [-1, 256, 2, 2]         590,080
      BatchNorm2d-83            [-1, 256, 2, 2]             512
             ReLU-84            [-1, 256, 2, 2]               0
       BasicBlock-85            [-1, 256, 2, 2]               0
           Conv2d-86            [-1, 256, 2, 2]         590,080
      BatchNorm2d-87            [-1, 256, 2, 2]             512
             ReLU-88            [-1, 256, 2, 2]               0
           Conv2d-89            [-1, 256, 2, 2]         590,080
      BatchNorm2d-90            [-1, 256, 2, 2]             512
             ReLU-91            [-1, 256, 2, 2]               0
       BasicBlock-92            [-1, 256, 2, 2]               0
           Conv2d-93            [-1, 256, 2, 2]         590,080
      BatchNorm2d-94            [-1, 256, 2, 2]             512
             ReLU-95            [-1, 256, 2, 2]               0
           Conv2d-96            [-1, 256, 2, 2]         590,080
      BatchNorm2d-97            [-1, 256, 2, 2]             512
             ReLU-98            [-1, 256, 2, 2]               0
       BasicBlock-99            [-1, 256, 2, 2]               0
          Conv2d-100            [-1, 512, 1, 1]       1,180,160
     BatchNorm2d-101            [-1, 512, 1, 1]           1,024
            ReLU-102            [-1, 512, 1, 1]               0
          Conv2d-103            [-1, 512, 1, 1]       2,359,808
     BatchNorm2d-104            [-1, 512, 1, 1]           1,024
          Conv2d-105            [-1, 512, 1, 1]         131,584
     BatchNorm2d-106            [-1, 512, 1, 1]           1,024
            ReLU-107            [-1, 512, 1, 1]               0
      BasicBlock-108            [-1, 512, 1, 1]               0
          Conv2d-109            [-1, 512, 1, 1]       2,359,808
     BatchNorm2d-110            [-1, 512, 1, 1]           1,024
            ReLU-111            [-1, 512, 1, 1]               0
          Conv2d-112            [-1, 512, 1, 1]       2,359,808
     BatchNorm2d-113            [-1, 512, 1, 1]           1,024
            ReLU-114            [-1, 512, 1, 1]               0
      BasicBlock-115            [-1, 512, 1, 1]               0
          Conv2d-116            [-1, 512, 1, 1]       2,359,808
     BatchNorm2d-117            [-1, 512, 1, 1]           1,024
            ReLU-118            [-1, 512, 1, 1]               0
          Conv2d-119            [-1, 512, 1, 1]       2,359,808
     BatchNorm2d-120            [-1, 512, 1, 1]           1,024
            ReLU-121            [-1, 512, 1, 1]               0
      BasicBlock-122            [-1, 512, 1, 1]               0
AdaptiveAvgPool2d-123            [-1, 512, 1, 1]               0
          Linear-124                   [-1, 10]           5,130
================================================================
Total params: 21,292,042
Trainable params: 21,292,042
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 1.72
Params size (MB): 81.22
Estimated Total Size (MB): 82.95
----------------------------------------------------------------
